export default function ModalPolicy() {
  return (
    <div>
      <p>
        https://goj.vercel.app이하 GOCO은 개인정보보호법에 따라 이용자의
        개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을
        원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
      </p>
      <p>
        GOCO은 개인정보처리방침을 개정하는 경우 웹사이트 공지사항을 통하여
        공지할 것입니다.
      </p>
      <p>&nbsp;</p>
      <p>○ 본 방침은부터 2022년 12월 11일부터 시행됩니다.</p>
      <p>&nbsp;</p>
      <p>
        1. 개인정보의 처리 목적 https://goj.vercel.app이하 GOCO은 개인정보를
        다음의 목적을 위해 처리합니다.
      </p>
      <p>
        처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이
        변경될 시에는 사전동의를 구할 예정입니다.
      </p>

      <p>
        &nbsp;&nbsp;가. 홈페이지 회원가입 및 관리 회원 가입의사 확인, 회원자격
        유지·관리, 서비스 부정이용 방지 등을 목적으로 개인정보를 처리합니다.
      </p>
      <p>
        &nbsp;&nbsp;나. 재화 또는 서비스 제공 서비스 제공, 콘텐츠 제공 등을
        목적으로 개인정보를 처리합니다.
      </p>
      <p>
        2. 개인정보 파일 현황 https://goj.vercel.app이하 GOCO가 개인정보
        보호법 제32조에 따라 등록․공개하는 개인정보파일의 처리목적은 다음과
        같습니다.
      </p>
      <p>1. 개인정보 파일명 : postgresql.db</p>
      <p>
        &nbsp;&nbsp;개인정보 항목 : 아이디, 닉네임, 비밀번호, 로그인ID, 쿠키,
        접속 IP
      </p>
      <p>&nbsp;&nbsp;정보 수집방법 : 홈페이지</p>
      <p>&nbsp;&nbsp;보유근거 : 회원의 이용자격 확인 및 부정이용 방지</p>
      <p>&nbsp;&nbsp;보유기간 : 준영구</p>
      <p>&nbsp;&nbsp;관련법령 : </p>
      <p>3. 개인정보의 처리 및 보유 기간</p>
      <p>
        &nbsp;&nbsp;① GOCO은 법령에 따른 개인정보 보유·이용기간 또는
        정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간
        내에서 개인정보를 처리,보유합니다.
      </p>
      <p>&nbsp;&nbsp;② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.</p>
      <p>
        &nbsp;&nbsp;1.홈페이지 회원가입 및 관리 홈페이지 회원가입 및 관리와
        관련한 개인정보는 수집.이용에 관한 동의일로부터준영구까지 위 이용목적을
        위하여 보유.이용됩니다.
      </p>
      <p>
        &nbsp;&nbsp;&nbsp;&nbsp;보유근거 : 회원의 이용자격 확인 및 부정이용 방지
      </p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;관련법령 : </p>
      <p>&nbsp;&nbsp;&nbsp;&nbsp;예외사유 : </p>
      <p>
        4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는
        개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.
      </p>
      <p>
        &nbsp;&nbsp;① 정보주체는 GOCO에 대해 언제든지 개인정보
        열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.
      </p>
    </div>
  );
}
